wp-content/plugins/a2z-fedex-shipping/controllors/xml/rate.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns="http://fedex.com/ws/rate/v31">
   <SOAP-ENV:Header/>
   <SOAP-ENV:Body>
      <RateRequest>
         <WebAuthenticationDetail>
            <UserCredential>
               <Key>{key}</Key>
               <Password>{pwd}</Password>
            </UserCredential>
         </WebAuthenticationDetail>
         <ClientDetail>
            <AccountNumber>{Account_num}</AccountNumber>
            <MeterNumber>{meter_number}</MeterNumber>
         </ClientDetail>
         <TransactionDetail>
            <CustomerTransactionId>*** PS Rate Request ***</CustomerTransactionId>
         </TransactionDetail>
         <Version>
            <ServiceId>crs</ServiceId>
            <Major>31</Major>
            <Intermediate>0</Intermediate>
            <Minor>0</Minor>
         </Version>
         {one_rate}
         <RequestedShipment>
            <ShipTimestamp>{timestramp}</ShipTimestamp>
            <DropoffType>REGULAR_PICKUP</DropoffType>
            <PackagingType>YOUR_PACKAGING</PackagingType>
            <TotalWeight>
               <Units>{weightunit}</Units>
               <Value>{totalweight}</Value>
            </TotalWeight>
            <PreferredCurrency>{currency}</PreferredCurrency>
            <Shipper>
               <AccountNumber>{Account_num}</AccountNumber>
               <Address>
                  <PostalCode>{s_postal}</PostalCode>
                  <CountryCode>{s_countr}</CountryCode>
               </Address>
            </Shipper>
            <Recipient>
               <Address>
                   <PostalCode>{r_postal}</PostalCode>
                  <CountryCode>{r_county}</CountryCode>
                  <Residential>{r_res}</Residential>
               </Address>
            </Recipient>
             <ShippingChargesPayment>
               <PaymentType>SENDER</PaymentType>
               <Payor>
                  <ResponsibleParty>
                     <AccountNumber>{Account_num}</AccountNumber>
                  </ResponsibleParty>
               </Payor>
            </ShippingChargesPayment>
            {ind_customs}
            <RateRequestTypes>{ac_rate}</RateRequestTypes>
            <PackageCount>{package_count}</PackageCount>
            {line_items}
			</RequestedShipment>
      </RateRequest>
   </SOAP-ENV:Body>
</SOAP-ENV:Envelope>